
## Plan Result

[CI link](https://github.com/cumet04/switchbot-logger/actions/runs/8385985895)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * google_bigquery_table.MetricTable_BigqueryTable_switchbot_metricss_this_8085DE34
* Update
  * google_bigquery_data_transfer_config.MetricTable_ScheduledQuery_DEVELOPMENTswitchbot_this_BFA0EC2C
* Delete
  * google_bigquery_table.MetricTable_BigqueryTable_switchbot_metrics_this_3784326D


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_bigquery_data_transfer_config.MetricTable_ScheduledQuery_DEVELOPMENTswitchbot_this_BFA0EC2C will be updated in-place
  ~ resource "google_bigquery_data_transfer_config" "MetricTable_ScheduledQuery_DEVELOPMENTswitchbot_this_BFA0EC2C" {
        id                       = "projects/903139270084/locations/asia-northeast1/transferConfigs/65d2a283-0000-2919-9371-94eb2c1cb878"
        name                     = "projects/903139270084/locations/asia-northeast1/transferConfigs/65d2a283-0000-2919-9371-94eb2c1cb878"
      ~ params                   = {
          ~ "query" = "ASSERT EXISTS ( SELECT * FROM switchbot.metrics WHERE Time > DATETIME_SUB(CURRENT_TIMESTAMP(), INTERVAL 10 MINUTE) )" -> "ASSERT EXISTS ( SELECT * FROM switchbot.metricss WHERE Time > DATETIME_SUB(CURRENT_TIMESTAMP(), INTERVAL 10 MINUTE) )"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_bigquery_table.MetricTable_BigqueryTable_switchbot_metrics_this_3784326D will be destroyed
  # (because google_bigquery_table.MetricTable_BigqueryTable_switchbot_metrics_this_3784326D is not in configuration)
  - resource "google_bigquery_table" "MetricTable_BigqueryTable_switchbot_metrics_this_3784326D" {
      - creation_time            = 1686487686454 -> null
      - dataset_id               = "switchbot" -> null
      - deletion_protection      = true -> null
      - effective_labels         = {} -> null
      - etag                     = "X6hHN+BeSHsNh0VRhMUGKQ==" -> null
      - expiration_time          = 0 -> null
      - id                       = "projects/sbox-fluentbit/datasets/switchbot/tables/metrics" -> null
      - labels                   = {} -> null
      - last_modified_time       = 1711085469132 -> null
      - location                 = "asia-northeast1" -> null
      - num_bytes                = 2150022784 -> null
      - num_long_term_bytes      = 1408484451 -> null
      - num_rows                 = 48409231 -> null
      - project                  = "sbox-fluentbit" -> null
      - require_partition_filter = false -> null
      - schema                   = jsonencode(
            [
              - {
                  - mode = "NULLABLE"
                  - name = "Time"
                  - type = "TIMESTAMP"
                },
              - {
                  - mode = "NULLABLE"
                  - name = "DeviceId"
                  - type = "STRING"
                },
              - {
                  - mode = "NULLABLE"
                  - name = "Type"
                  - type = "STRING"
                },
              - {
                  - mode = "NULLABLE"
                  - name = "Value"
                  - type = "FLOAT"
                },
            ]
        ) -> null
      - self_link                = "https://bigquery.googleapis.com/bigquery/v2/projects/sbox-fluentbit/datasets/switchbot/tables/metrics" -> null
      - table_id                 = "metrics" -> null
      - terraform_labels         = {} -> null
      - type                     = "TABLE" -> null

      - time_partitioning {
          - expiration_ms            = 0 -> null
          - field                    = "Time" -> null
          - require_partition_filter = false -> null
          - type                     = "DAY" -> null
        }
    }

  # google_bigquery_table.MetricTable_BigqueryTable_switchbot_metricss_this_8085DE34 will be created
  + resource "google_bigquery_table" "MetricTable_BigqueryTable_switchbot_metricss_this_8085DE34" {
      + creation_time       = (known after apply)
      + dataset_id          = "switchbot"
      + deletion_protection = true
      + effective_labels    = (known after apply)
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + id                  = (known after apply)
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = "sbox-fluentbit"
      + schema              = jsonencode(
            [
              + {
                  + mode = "NULLABLE"
                  + name = "Time"
                  + type = "TIMESTAMP"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "DeviceId"
                  + type = "STRING"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "Type"
                  + type = "STRING"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "Value"
                  + type = "FLOAT"
                },
            ]
        )
      + self_link           = (known after apply)
      + table_id            = "metricss"
      + terraform_labels    = (known after apply)
      + type                = (known after apply)

      + time_partitioning {
          + expiration_ms = (known after apply)
          + field         = "Time"
          + type          = "DAY"
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"invoke","PRNumber":32,"Program":"tfcmt","SHA1":"3701e502a40cc9001a283330006198d1453d4cb5","Vars":{},"WorkflowName":"infra-plan"} -->